; domain
(define (domain blocksworld)
    (:requirements :strips :typing :fluents :adl :derived-predicates)
    (:types cube tower robot)

    (:predicates 
     (ontable ?x - cube)
     (on ?x - cube ?y - cube)
     (clear ?x - cube)
     (handempty ?r - robot)
     (holding ?r - robot ?x - cube)
     (touches ?x - cube ?y - cube)
     (behind ?x - cube ?y - cube)               ; Cube x is behind of cube y
     (disjoint ?x - cube ?y - cube)
     (ontower ?x - cube ?t - tower)

     (adjacent-left ?x - cube ?y - cube)
     ;(adjacent-right ?x - cube ?y - cube)
     (right-of ?x - cube ?y - cube)            ; Cube x is to the right of cube y
     (adjacent-top ?x - cube ?y - cube)
     (triangle-three ?x - cube ?top - cube ?mid - cube)
    )
        
    (:action pick-up
     :parameters (?r - robot ?x - cube)
     :precondition (and (ontable ?x) 
                        (clear ?x) 
                        (handempty ?r))
     :effect (and (holding ?r ?x)
             (not (ontable ?x))
             (not (clear ?x))
             (not (handempty ?r))))
    
     (:action put-down
      :parameters (?r - robot ?x - cube)
      :precondition (and (holding ?r ?x))
      :effect (and (ontable ?x)
                   (clear ?x)
                   (handempty ?r)
              (not (holding ?r ?x))))

    (:action stack
     :parameters (?r - robot ?x - cube ?y - cube)
     :precondition (and (holding ?r ?x) 
                        (clear ?y))
     :effect (and (on ?x ?y)
                  (clear ?x)
                  (handempty ?r)
                  (touches ?x ?y)
             (not (holding ?r ?x))
             (not (clear ?y))))
    
     (:action unstack
     :parameters (?r - robot ?x - cube ?y - cube)
     :precondition (and (on ?x ?y) 
                        (clear ?x) 
                        (handempty ?r))
     :effect (and (holding ?r ?x)
                  (not (handempty ?r))
                  (not (clear ?x))
                  (not (touches ?x ?y))
                  (clear ?y)
             (not (on ?x ?y))))     

    (:action adjacent-left
    :parameters (?r - robot ?x - cube ?y - cube)
    :precondition (and  (holding ?r ?x) 
                        (ontable ?y))
    :effect (and (adjacent-left ?x ?y)
                 (ontable ?x)
                 (clear ?x)
                 (handempty ?r)
                 (not (holding ?r ?x))))

    (:action place-right-of
        :parameters (?r - robot ?x - cube ?y - cube)
        :precondition (and (holding ?r ?x)
                           (ontable ?y)
                           (clear ?y))
        :effect (and 
                (not (holding ?r ?x))
                (not (behind ?x ?y))
                (handempty ?r)
                (ontable ?x)
                (clear ?x)
                (touches ?x ?y)
                (right-of ?x ?y))
    )

    (:action place-middle-behind
        :parameters (?r - robot ?x - cube ?y - cube ?z - cube)
        :precondition (and (holding ?r ?z)
                           (right-of ?x ?y)
                           (touches ?x ?y)
                           (ontable ?x)
                           (ontable ?y)
                           (clear ?x)
                           (clear ?y))
        :effect (and (not (holding ?r ?z))
                     (ontable ?z)
                     (clear ?z)
                     (behind ?z ?x)
                     (handempty ?r)
                     (touches ?z ?y)
                     (touches ?z ?x)
                     (not (right-of ?z ?x)))
    )
    
    

    ;(:action adjacent-right
    ;:parameters (?r - robot ?x - cube ?y - cube)
    ;:precondition (and (holding ?r ?x)
    ;                    (ontable ?y))
    ;:effect (and (adjacent-right ?x ?y)
    ;             (ontable ?x)
    ;             (clear ?x)
    ;             (handempty ?r)
    ;             (not (holding ?r ?x))))

    (:action adjacent-top
    :parameters (?r - robot ?x - cube ?y - cube)
    :precondition (and (holding ?r ?x) (ontable ?y))
    :effect (and (adjacent-top ?x ?y)
                 (ontable ?x)
                 (clear ?x)
                 (handempty ?r)
                 (not (holding ?r ?x))))

    (:action triangle-three
    :parameters (?r - robot ?x - cube ?top -  cube ?mid - cube)
    :precondition (and (handempty ?r)(ontable ?x)
                  (clear ?x)
                  (clear ?top)
                  (clear ?mid)
                  (adjacent-top ?x ?top))
    :effect (and (not (ontable ?x))
            (on ?mid ?x)
            (clear ?x)
            (handempty ?r)))   
)

; problem
(define (problem goal2_blocksworld_tower)
    (:domain blocksworld)
    (:objects
    r - robot
    red green blue yellow magenta cyan - cube
    tower1 - tower)

    (:init
    (clear red)
    (clear green)
    (clear blue)
    (clear yellow)
    (clear magenta)
    (clear cyan)
    (ontable red)
    (ontable green)
    (ontable blue)
    (ontable yellow)
    (ontable magenta)
    (ontable cyan)
    (handempty r)
    )
    
    (:goal (and
      (clear magenta)

      (on magenta yellow)
      (on yellow blue)
      (on blue red)
      (on red green)

      (ontable green)
    ))
    )

; plan
1. (pick-up r red)
   deleted: (ontable red) (clear red) (handempty r)
   added: (holding r red)
   goals met: 2 of 6
2. (stack r red green)
   deleted: (holding r red) (clear green)
   added: (on red green) (clear red) (handempty r) (touches red green)
   goals met: 3 of 6
3. (pick-up r blue)
   deleted: (ontable blue) (clear blue) (handempty r)
   added: (holding r blue)
   goals met: 3 of 6
4. (stack r blue red)
   deleted: (holding r blue) (clear red)
   added: (on blue red) (clear blue) (handempty r) (touches blue red)
   goals met: 4 of 6
5. (pick-up r yellow)
   deleted: (ontable yellow) (clear yellow) (handempty r)
   added: (holding r yellow)
   goals met: 4 of 6
6. (stack r yellow blue)
   deleted: (holding r yellow) (clear blue)
   added: (on yellow blue) (clear yellow) (handempty r) (touches yellow blue)
   goals met: 5 of 6
7. (pick-up r magenta)
   deleted: (ontable magenta) (clear magenta) (handempty r)
   added: (holding r magenta)
   goals met: 4 of 6
8. (stack r magenta yellow)
   deleted: (holding r magenta) (clear yellow)
   added: (on magenta yellow) (clear magenta) (handempty r) (touches magenta yellow)
   goals met: 6 of 6
